Revit 2024 API
BuiltInFailures.RebarShapeFailures.DimensionWithoutParameter Property
 Dimension has no parameter assigned to it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DimensionWithoutParameter { get; }
Visual Basic
Public Shared ReadOnly Property DimensionWithoutParameter As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DimensionWithoutParameter {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace